Revit 2024 API
DockablePanes.BuiltInDockablePanes.PnIdModelerBrowser Property
 The P&ID modeler browser pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static DockablePaneId PnIdModelerBrowser { get; }
Visual Basic
Public Shared ReadOnly Property PnIdModelerBrowser As DockablePaneId
	Get
Visual C++
public:
static property DockablePaneId^ PnIdModelerBrowser {
	DockablePaneId^ get ();
}
See Also
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace